# Dataframes in Panda

In [1]:
import pandas as pd

In [2]:
data = {"primer_nombre":["Juan","Pedro","Luisa","Camila"],
       "segundo_nombre":["Pablo","Sebastian","Fernanda","Laura"],
       "estatura(m)":[1.5,1.68,1.80,1.7],
        "estudia":["No","Si","Si","No"]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  primer_nombre segundo_nombre  estatura(m) estudia
0          Juan          Pablo         1.50      No
1         Pedro      Sebastian         1.68      Si
2         Luisa       Fernanda         1.80      Si
3        Camila          Laura         1.70      No

In [5]:
df["primer_nombre"]

0      Juan
1     Pedro
2     Luisa
3    Camila
Name: primer_nombre, dtype: object

In [6]:
df["estatura(in)"] = df["estatura(m)"]* 39.3701

In [7]:
df["estatura(in)"]

0    59.055150
1    66.141768
2    70.866180
3    66.929170
Name: estatura(in), dtype: float64

In [8]:
df.dtypes

primer_nombre      object
segundo_nombre     object
estatura(m)       float64
estudia            object
estatura(in)      float64
dtype: object

In [9]:
df["estudia"]=df["estudia"].astype("category")

In [10]:
df

  primer_nombre segundo_nombre  estatura(m) estudia  estatura(in)
0          Juan          Pablo         1.50      No     59.055150
1         Pedro      Sebastian         1.68      Si     66.141768
2         Luisa       Fernanda         1.80      Si     70.866180
3        Camila          Laura         1.70      No     66.929170

In [11]:
df["apellido"]=["Fonseca","Rosales","Salomon","Martinez"]

In [12]:
df

  primer_nombre segundo_nombre  estatura(m) estudia  estatura(in)  apellido
0          Juan          Pablo         1.50      No     59.055150   Fonseca
1         Pedro      Sebastian         1.68      Si     66.141768   Rosales
2         Luisa       Fernanda         1.80      Si     70.866180   Salomon
3        Camila          Laura         1.70      No     66.929170  Martinez

In [13]:
df.shape

(4, 6)

In [14]:
df["codigo"]=["L1","G2","P1","K2"]

In [15]:
df.set_index("codigo",inplace=True)

In [16]:
df

,primer_nombre,segundo_nombre,estatura(m),estudia,estatura(in),apellido
codigo,,,,,,
L1,Juan,Pablo,1.50,No,59.055150,Fonseca
G2,Pedro,Sebastian,1.68,Si,66.141768,Rosales
P1,Luisa,Fernanda,1.80,Si,70.866180,Salomon
K2,Camila,Laura,1.70,No,66.929170,Martinez

In [17]:
#del df["apellido"]

In [18]:
df

,primer_nombre,segundo_nombre,estatura(m),estudia,estatura(in),apellido
codigo,,,,,,
L1,Juan,Pablo,1.50,No,59.055150,Fonseca
G2,Pedro,Sebastian,1.68,Si,66.141768,Rosales
P1,Luisa,Fernanda,1.80,Si,70.866180,Salomon
K2,Camila,Laura,1.70,No,66.929170,Martinez

In [19]:
#df= df.drop(["L1"],axis=0,inplace=True) borrar una fila u columna axis=0,1 y siempre inplace=True

In [20]:
df

,primer_nombre,segundo_nombre,estatura(m),estudia,estatura(in),apellido
codigo,,,,,,
L1,Juan,Pablo,1.50,No,59.055150,Fonseca
G2,Pedro,Sebastian,1.68,Si,66.141768,Rosales
P1,Luisa,Fernanda,1.80,Si,70.866180,Salomon
K2,Camila,Laura,1.70,No,66.929170,Martinez

In [21]:
df

,primer_nombre,segundo_nombre,estatura(m),estudia,estatura(in),apellido
codigo,,,,,,
L1,Juan,Pablo,1.50,No,59.055150,Fonseca
G2,Pedro,Sebastian,1.68,Si,66.141768,Rosales
P1,Luisa,Fernanda,1.80,Si,70.866180,Salomon
K2,Camila,Laura,1.70,No,66.929170,Martinez

In [22]:
df=df[["primer_nombre","segundo_nombre","apellido","estatura(m)","estatura(in)","estudia"]]

In [25]:
df.to_excel("datos.xlsx")

In [27]:
df.to_csv("datos.csv")

In [32]:
df.loc["P1"] #from the id in the dataframe

primer_nombre        Luisa
segundo_nombre    Fernanda
apellido           Salomon
estatura(m)            1.8
estatura(in)       70.8662
estudia                 Si
Name: P1, dtype: object

In [33]:
df.iloc[0] #from the position in the dataframe

primer_nombre        Juan
segundo_nombre      Pablo
apellido          Fonseca
estatura(m)           1.5
estatura(in)      59.0551
estudia                No
Name: L1, dtype: object

In [35]:
df.loc["G2","estudia"]

'Si'

In [40]:
df.sort_index(ascending=False)

,primer_nombre,segundo_nombre,apellido,estatura(m),estatura(in),estudia
codigo,,,,,,
P1,Luisa,Fernanda,Salomon,1.80,70.866180,Si
L1,Juan,Pablo,Fonseca,1.50,59.055150,No
K2,Camila,Laura,Martinez,1.70,66.929170,No
G2,Pedro,Sebastian,Rosales,1.68,66.141768,Si

In [42]:
df.sort_values(by=["apellido","estatura(m)"])

,primer_nombre,segundo_nombre,apellido,estatura(m),estatura(in),estudia
codigo,,,,,,
L1,Juan,Pablo,Fonseca,1.50,59.055150,No
K2,Camila,Laura,Martinez,1.70,66.929170,No
G2,Pedro,Sebastian,Rosales,1.68,66.141768,Si
P1,Luisa,Fernanda,Salomon,1.80,70.866180,Si

In [43]:
df.loc["Z1"]=["Mauricio","Carlos","Preciado",1.80,1.80*39.3701,"No"]

In [44]:
df

,primer_nombre,segundo_nombre,apellido,estatura(m),estatura(in),estudia
codigo,,,,,,
L1,Juan,Pablo,Fonseca,1.50,59.055150,No
G2,Pedro,Sebastian,Rosales,1.68,66.141768,Si
P1,Luisa,Fernanda,Salomon,1.80,70.866180,Si
K2,Camila,Laura,Martinez,1.70,66.929170,No
Z1,Mauricio,Carlos,Preciado,1.80,70.866180,No

In [57]:
filtro = (df["estudia"]!="Si")&(df["estatura(m)"]<=1.7)

In [55]:
filtro

codigo
L1    False
G2    False
P1    False
K2    False
Z1    False
dtype: bool

In [56]:
df[filtro]

Empty DataFrame
Columns: [primer_nombre, segundo_nombre, apellido, estatura(m), estatura(in), estudia]
Index: []